In [1]:
import pandas as pd
import numpy as np

df = pd.read_csv('./Data/rapido_data.csv')

df.head()

,services,date,time,ride_status,source,destination,duration,ride_id,distance,ride_charge,misc_charge,total_fare,payment_method
0,cab economy,2024-07-15,08:30:40.542646,completed,Balagere Harbor,Harohalli Nagar,39,RD3161218751875354,27.21,764.83,31.51,796.34,Amazon Pay
1,auto,2024-07-05,23:36:51.542646,completed,Basavanagudi 3rd Block,Bikasipura 1st Stage,89,RD8171514284594096,34.03,314.83,49.52,364.35,Paytm
2,auto,2024-07-23,11:05:37.542646,cancelled,Babusapalya Cove,Kothaguda Terrace,25,RD9376481122237926,20.24,NaN,NaN,NaN,NaN
3,cab economy,2024-06-24,08:45:10.542646,completed,Mahadevapura Mews,Kanakapura Arc,89,RD3676889143182765,31.17,484.73,15.84,500.57,QR scan
4,cab economy,2024-07-15,00:26:44.542646,completed,Ganganagar Cove,Basaveshwaranagar Colony,95,RD6639410275948084,27.21,663.50,14.13,677.63,Amazon Pay

In [2]:
df.shape

(50000, 13)

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   services        50000 non-null  object
 1   date            50000 non-null  object
 2   time            50000 non-null  object
 3   ride_status     50000 non-null  object
 4   source          50000 non-null  object
 5   destination     50000 non-null  object
 6   duration        50000 non-null  int64
 7   ride_id         50000 non-null  object
 8   distance        50000 non-null  float64
 9   ride_charge     44964 non-null  float64
 10  misc_charge     44964 non-null  float64
 11  total_fare      44964 non-null  float64
 12  payment_method  44964 non-null  object
dtypes: float64(4), int64(1), object(8)
memory usage: 5.0+ MB

In [4]:
df.dropna(inplace=True)

In [5]:
df.isnull().sum()

services          0
date              0
time              0
ride_status       0
source            0
destination       0
duration          0
ride_id           0
distance          0
ride_charge       0
misc_charge       0
total_fare        0
payment_method    0
dtype: int64

In [6]:
df.shape

(44964, 13)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 44964 entries, 0 to 49999
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   services        44964 non-null  object
 1   date            44964 non-null  object
 2   time            44964 non-null  object
 3   ride_status     44964 non-null  object
 4   source          44964 non-null  object
 5   destination     44964 non-null  object
 6   duration        44964 non-null  int64
 7   ride_id         44964 non-null  object
 8   distance        44964 non-null  float64
 9   ride_charge     44964 non-null  float64
 10  misc_charge     44964 non-null  float64
 11  total_fare      44964 non-null  float64
 12  payment_method  44964 non-null  object
dtypes: float64(4), int64(1), object(8)
memory usage: 4.8+ MB

In [8]:
df.describe()

           duration      distance   ride_charge   misc_charge    total_fare
count  44964.000000  44964.000000  44964.000000  44964.000000  44964.000000
mean      64.366226     25.500013    522.428805     24.964289    547.393093
std       31.837423     14.164482    274.726031     14.459417    275.094813
min       10.000000      1.000000     50.030000      0.000000     50.580000
25%       37.000000     13.270000    283.657500     12.400000    308.920000
50%       64.000000     25.400000    520.030000     25.070000    544.920000
75%       92.000000     37.830000    759.367500     37.510000    785.502500
max      119.000000     50.000000    999.960000     50.000000   1048.800000

In [9]:
df.describe(include='all')

,services,date,time,ride_status,source,destination,duration,ride_id,distance,ride_charge,misc_charge,total_fare,payment_method
count,44964,44964,44964,44964,44964,44964,44964.000000,44964,44964.000000,44964.000000,44964.000000,44964.000000,44964
unique,5,61,44441,1,12819,12828,NaN,44964,NaN,NaN,NaN,NaN,4
top,bike,2024-08-03,19:55:36.542646,completed,Kothanur Landing,Gottigere Landing,NaN,RD3161218751875354,NaN,NaN,NaN,NaN,Paytm
freq,13567,813,3,44964,20,21,NaN,1,NaN,NaN,NaN,NaN,11315
mean,NaN,NaN,NaN,NaN,NaN,NaN,64.366226,NaN,25.500013,522.428805,24.964289,547.393093,NaN
std,NaN,NaN,NaN,NaN,NaN,NaN,31.837423,NaN,14.164482,274.726031,14.459417,275.094813,NaN
min,NaN,NaN,NaN,NaN,NaN,NaN,10.000000,NaN,1.000000,50.030000,0.000000,50.580000,NaN
25%,NaN,NaN,NaN,NaN,NaN,NaN,37.000000,NaN,13.270000,283.657500,12.400000,308.920000,NaN
50%,NaN,NaN,NaN,NaN,NaN,NaN,64.000000,NaN,25.400000,520.030000,25.070000,544.920000,NaN
75%,NaN,NaN,NaN,NaN,NaN,NaN,92.000000,NaN,37.830000,759.367500,37.510000,785.502500,NaN
max,NaN,NaN,NaN,NaN,NaN,NaN,119.000000,NaN,50.000000,999.960000,50.000000,1048.800000,NaN

In [10]:
df.columns

Index(['services', 'date', 'time', 'ride_status', 'source', 'destination',
       'duration', 'ride_id', 'distance', 'ride_charge', 'misc_charge',
       'total_fare', 'payment_method'],
      dtype='object')

In [11]:
df['services'].unique()

array(['cab economy', 'auto', 'parcel', 'bike lite', 'bike'], dtype=object)

In [12]:
# count occurrences of each service and sort by count (descending)
df['services'].value_counts().sort_values(ascending=False)

services
bike           13567
auto           11114
cab economy     9148
parcel          6747
bike lite       4388
Name: count, dtype: int64

In [13]:
df['date'] = pd.to_datetime(df['date'])

df['year'] = df['date'].dt.year
df['month'] = df['date'].dt.month_name()
df['day'] = df['date'].dt.day_name()
df['m'] = df['date'].dt.month

In [16]:
df['datetime'] = df['date'] + pd.to_timedelta(df['time'])
df['hour'] = df['datetime'].dt.hour
df['hour'].unique()

array([ 8, 23,  0,  1, 20, 13,  7, 12, 16, 17,  5, 18, 22, 11, 10,  6,  4,
       14, 15, 21,  3,  2,  9, 19], dtype=int32)

In [17]:
df['ride_status'].unique()

array(['completed'], dtype=object)

In [20]:
df['source'].unique()

array(['Balagere Harbor', 'Basavanagudi 3rd Block', 'Mahadevapura Mews',
       ..., 'Jakkur Cross', 'Kanaka Nagar 5th Stage', 'Whitefield Grove'],
      shape=(12819,), dtype=object)

In [21]:
df['destination'].unique()

array(['Harohalli Nagar', 'Bikasipura 1st Stage', 'Kanakapura Arc', ...,
       'KR Puram Road', 'Madivala 4th Stage', 'Lingarajapuram Crescent'],
      shape=(12828,), dtype=object)

In [23]:
df['duration'].max()

np.int64(119)

In [24]:
df.columns

Index(['services', 'date', 'time', 'ride_status', 'source', 'destination',
       'duration', 'ride_id', 'distance', 'ride_charge', 'misc_charge',
       'total_fare', 'payment_method', 'year', 'month', 'day', 'm', 'datetime',
       'hour'],
      dtype='object')

In [ ]:
df.drop(columns={'source','ride_status','destination','year','m','datetime'}, index=1, inplace=True)

In [32]:
df['hour'].unique()

array([ 8,  0,  1, 20, 13,  7, 12, 16, 17,  5, 18, 22, 11, 10,  6,  4, 14,
       15, 21, 23,  3,  2,  9, 19], dtype=int32)

In [34]:
def time_slot(hour):
    if 5 <= hour and hour <=12:
        return 'Morning'
    elif 12 < hour and hour <= 17:
        return 'Afternoon'
    elif 17 < hour and hour <= 21:
        return 'Evening'
    else:
        return 'Night'
    
df['time_segment'] = df['hour'].apply(time_slot)
df['time_segment'].head(10)

0       Morning
3       Morning
4         Night
5         Night
6       Evening
7     Afternoon
8       Morning
9       Morning
10    Afternoon
11    Afternoon
Name: time_segment, dtype: object

In [ ]:
df.drop(columns={}, inplace=True)

In [37]:
df.head()

,services,date,time,duration,ride_id,distance,ride_charge,misc_charge,total_fare,payment_method,month,day,hour,time_segment
0,cab economy,2024-07-15,08:30:40.542646,39,RD3161218751875354,27.21,764.83,31.51,796.34,Amazon Pay,July,Monday,8,Morning
3,cab economy,2024-06-24,08:45:10.542646,89,RD3676889143182765,31.17,484.73,15.84,500.57,QR scan,June,Monday,8,Morning
4,cab economy,2024-07-15,00:26:44.542646,95,RD6639410275948084,27.21,663.50,14.13,677.63,Amazon Pay,July,Monday,0,Night
5,auto,2024-07-02,01:28:29.542646,18,RD5922205486441934,33.69,456.73,25.19,481.92,QR scan,July,Tuesday,1,Night
6,cab economy,2024-07-23,20:55:28.542646,85,RD9557099396888459,20.44,836.39,14.95,851.34,GPay,July,Tuesday,20,Evening

In [38]:
from sqlalchemy import create_engine
import psycopg2
username = 'postgres'
password = '80193'
host = 'localhost'
port = '5432'
database = 'customerDB'

engine = create_engine(f'postgresql+psycopg2://{username}:{password}@{host}:{port}/{database}')

table_name = 'rapido'
df.to_sql(table_name, engine, if_exists="replace", index=False)
print("Successfully Loaded data to pgAdmin")

Successfully Loaded data to pgAdmin